// Question #2
/*
สมมุติว่ามี Variable inventory ที่บรรจุข้อมูลสินค้า เช่น ราคาสินค้า (price) และจำนวนสินค้าในคลังสินค้า (quantity) ซึ่งมีโครงสร้างข้อมูลดังนี้

- ให้เขียนโปรแกรมดังนี้
    
    1) ให้แก้ไขจำนวนสินค้า “Apple” จาก `100` เป็น `200`                                     //แก้ แอปเปิ้ล ให้เป็น 200
    
    2) เพิ่มสินค้าใหม่ที่ชื่อ “Orange” ที่มีราคา `20` บาท และมีจำนวน `300` ชิ้นในสต็อก               //เพิ่ม ส้ม เข้าสต็อก
    
    3) ให้คำนวณมูลค่ารวมของจำนวนสินค้าทั้งหมดในสต็อก                                         //รวมเงินทั้งหมดในสต็อก
    
- ผลลัพธ์ของโปรแกรมควรจะแสดงออกมาทางหน้าจอ Console แบบนี้
*/
const inventory = [                                                                   //เขียนไว้อ่านเองกัน งง
  { name: "Apple", price: 35, quantity: 100 },
  { name: "Banana", price: 10, quantity: 50 },
];
// เริ่มเขียนโค้ดตรงนี้

for (const item of inventory) {                                                       //โจทย์ 1 หาแอปเปิ้ลและแก้เป็น 200
  if (item.name === "Apple") {
    item.quantity = 200;
  }
}
inventory.push({                                                                      //โจทย์ 2 เพิ่ม ส้ม เข้าสต็อก
  name:"Orange",
  price:20,
  quantity: 300,
});

let total =0;                                                                         //โจทย์ 3 เก็บค่าไว้ในนี้

for (const item of inventory) {                                                       
  total += item.price * item.quantity;                                                //คิดมูลค่าสินค้าทั้งหมด ราคา กับ จำนวน
}
console.log(                                                                          //แสดงผลลัพธ์ทั้งหมด 
  `มูลค่ารวมของจำนวนสินค้าทั้งหมดในสต็อก ${total} บาท`
)